[
    {   "title" : "Samsung Galaxy Z Flip4 review",
        "image": "image/blog1.jpg",
        "blog" : ["Another Samsung Unpacked event has come to pass, and this one brought us the fourth generation of foldable Galaxy smartphones. Quite expectedly, Samsung announced the fourquels of the Fold and Flip, the first being more like a foldable tablet, while the Flip - a nostalgia-sprinkled flip phone. Today, we will be exploring the Samsung Galaxy Z Flip4, which is much like the Galaxy Z Flip3, but better. This is a formula that's been in use for years now as the technology cannot advance as fast as makers are bringing a new version of their phones. But while the new Z Flip4 won't make many (if any) Z Flip3 owners upgrade, it improves enough bits to make even more people think of getting this new foldable flagship.Samsung has improved on the Galaxy Z Flip3 by tweaking all weak points both reviewers and users have agreed upon - low-light camera performance, battery life, charging speed. And, of course, the new Z Flip4 gets to boast the most current Android chip - the Snapdragon 8+ Gen 1.",
        "The new Galaxy Z Flip4 features the same internal Dynamic AMOLED 2X and external Super AMOLED screens as the Z Flip3. But thanks to reduced bezels around the foldable screen and a flatter aluminum frame, the Z Flip4 is now a bit shorter and with a thinner hinge.The Foldable Dynamic AMOLED 2X remains equally adaptive with up to 120Hz refresh rate and equally bright with a peak brightness up to 1200 nits. The crease in the middle is here to stay for now and so is the perforation for the selfie camera.The Z Flip4 is IPX8-rated for water resistance - a feature that only Samsung offers across its third and fourth generation of foldable devices. Samsung and Sony are the only two makers that aim to offer water protection on most of their phones, and we truly appreciate the effort.Besides the chipset upgrade, the Galaxy Z Flip4 also features an improved camera system on the back. It is still a dual-camera setup, but the main shooter now relies on a larger 12MP sensor with 1.8µm pixels coupled with a wider 24mm f/1.8 OIS lens. This new sensor should allow for a 65% improvement in light gathering and improve the low-light performance. The 12MP ultrawide and 10MP selfie cameras remain the same as on the Flip3.The Galaxy Z Flip4 is powered by a 12% larger battery - it now packs a 3,700mAh cell, up from 3,300mAh within the Flip3. And even better, the phone now supports 25W fast charging, up from the sluggish 15W. The wireless fast charging has been sped up, too, now up to 15W."]
    },
    {
        "title": "Iphone 14 Pro Max release",
        "image": "image/blog2.jpg",
        "blog": ["The best iPhone ever, version 2022, size XL - we have the iPhone 14 Pro Max. The list of novelties this year includes the notch morphing into a pill, the introduction of an Always-On display, and an all-new primary camera - and while you can get all of that on the 14 Pro, the extra screen estate and longevity coupled with the Max's 'ultimate' status mean it has a market niche of its own.","The Face ID notch that's been with us since the iPhone X was nobody's favorite, and perhaps its reincarnation as a pill is a step towards its eventual removal. But not before turning the eyesore into a feature - the pill is a Dynamic Island of notifications, blurring the line between hardware and software.In a similar vein is the Always-On display - a software feature only made possible now in Apple's world thanks to LTPO displays being able to ramp down to 1Hz refresh rate.A massive increase in brightness is also among the key developments this year, this one solely in the hardware department.Late to yet another party, Apple finally joins virtually every other manufacturer and introduces a camera with a Quad Bayer type sensor - the specs on the 48MP main unit don't read like any other, so apparently, it's an exclusive design. The telephoto remains unchanged, but the ultrawide has gotten a sensor size upgrade, while the front-facing one now features autofocus (and maybe even OIS).On the hardware front, there's the mandatory chipset update, of course, and little else worth mentioning. Well, there's the blanked-out SIM card slot for the US models, which will only operate with eSIMs - does that count as a hardware change? Crash detection and emergency sort-of satellite connectivity are also on the list of new features combining software and hardware."]
    },
    {
        "title":"Oppo Reno8 review",
        "image":"image/blog3.jpg",
        "blog":["The Reno8 series has been out in China for almost two months now, but this is the first time the Reno8 and the Reno8 Pro step outside of their home country. The global versions of the handsets are slightly different from their Chinese counterparts, although the changes are rather negligible.","The focus of this review would be the vanilla Reno8, and it swaps out the depth sensor on the Chinese version for a full-fledged camera - an 8MP ultrawide one, to be exact. The rest of the specs are pretty much identical.The handset features a bright 6.43-inch 90Hz OLED panel, which would most likely attract users looking for something more compact because, let's face it, 6.43\" in 2022 is in the lower size range. Being small doesn't mean being small on features, though. The Reno8 runs on a very potent Dimenstiy 1300 SoC and has two standout cameras.","Oppo is particularly proud of using Sony's 50MP IMX766 sensor as the main shooter, which is fairly large- 1/1.56\" and offers 1.0µm pixels. On the front, the Reno8 carries an Oppo-exclusive 32MP IMX709 sensor with an RGBW filter allowing for an improved selfie performance. That's one of the phone's selling points, after all. It's important to note, though, that the Reno8 Pro has the same exact camera setup, so if the camera performance is your main priority, the Reno8 would probably do while being significantly cheaper than the Pro.","The vanilla option also doesn't skip the blazing-fast charging. The same 4,500 mAh battery supports 80W SuperVOOC charging protocol from Oppo, although countries with 110V power grids can get only 66W out of the same brick.It's probably worth noting that the Oppo Reno8 is almost identical to the OnePlus Nord 2T. The main difference between the two is the design and the OS. OnePlus' OxygenOS is still somewhat cleaner than Oppo's ColorOS, so it strongly depends on one's personal preferences towards Android skins.So in a sense, this review can be used as a reference when looking for OnePlus Nord 2T-relevant information. Most, if not all, of the results from our tests, would be applicable to some extent."]
    },{
        "title":"Oppo Find X2 Pro review",
        "image":"image/blog4.jpg",
        "blog":["For this generation, Oppo has shuffled up the priorities, and we don't mind the new ones. For starters, an all-around impressive camera setup with big sensors and capable lenses, entirely unique to the Find X2 Pro, beats the Find X's limited (if good for what it was) stow-away outfit. You get a 48MP 1/1.43\" f/1.7 primary cam and another 48MP 1/2.0\" f/2.2 ultra-wide, each outspeccing competitors' offerings in one way or another. And the cherry on top of all that is the 13MP telephoto cam with a 5x periscope lens that beats the Galaxy S20 Ultra in zoom power, if not in resolution and sensor size.","Keeping the cameras static has meant a hole in the display, which isn't ideal, particularly when the previous generation had no such blemishes. But what a display it is, indeed - high resolution, high refresh rate, high brightness, high dynamic range, high color fidelity - high everything. We'd take all that and live with the punch hole.And that is one of very compromises on the Find X2 Pro. It doesn't have wireless charging, but that's not really a make or break feature, the lack of a headphone jack is hardly news at this point, and who is really going to lament the missing microSD card slot with half a terabyte of built-in UFS 3.0 storage?","The Find X2 Pro also has an IP68 rating, the '8' being a first for Oppo with water and dust protection quite rare in the company's lineup to begin with. Stereo speakers get a check mark in the specsheet too and the 65 watts in the charging section are among the most watts you can get on a phone these days."]
    },{
        "title":"Oppo Reno7 5G/Find X5 Lite review",
        "image":"image/blog5.jpg",
        "blog":["Oppo is launching the Reno7 5G under two names in Europe and India. The Reno 7 5G is launching in India (and probably some parts of Eastern Europe), whereas the rest of Europe is getting it as the Find X5 Lite. The two models are identical in specs as you can see.We won't pretend we can make any sense out of the Oppo's Reno7 midrange series, but we can surely review them just like they were made official - in no particular order. So, today we have probably one of the most interesting specimens of the Reno7 bunch - the Oppo Reno7 5G.","The Reno7 5G is not just a 5G-enabled version of the global Reno7 smartphone as it has a different camera setup, different chipset, different charging speed, and even different storage.","The Oppo Reno7 5G/Find X5 Lite is quite an interesting offer. It's a lightweight plastic phone built around a 6.43-inch AMOLED with 1080p resolution, 90Hz refresh rate and HDR10 support. The Dimensity 900 5G chipset is underneath, which should do great for casual gaming and smooth overall performance.The camera setup is quite familiar as it has become somewhat of a golden standard for the midrange - there is a high-res 64MP primary camera, an 8MP ultrawide shooter and a 2MP imager for closeups. On the other side, within a small perforation on the display, is a 32MP selfie camera.","The Reno7 5G/Find X5 Lite is powered by a 4,500mAh battery that supports 65W VOOC charging. The power adapter is bundled with the phone, and it should do a full charge in half an hour. You bet we'd put that to the test.Oppo advertises the Reno7 5G/Find X5 Lite for its camera skills and portrait capabilities, fast charging, and gaming-friendly chipset with adequate cooling. And it is indeed a rather palm- and pocket-friendly device that's 160mm tall and 173g of weight.If you are familiar with the Oppo Reno6 5G, you may notice that this Reno7 5G is pretty much the same phone with updated storage, increased battery capacity, HDR10 screen certification and an audio jack. Lack of sensible upgrades is somewhat a theme in 2022, quite common actually. So, the Reno6 5G users are skipping this one for sure."]
    },{
        "title":"Apple iPhone 13 Pro Max review",
        "image":"image/blog6.jpg",
        "blog":["Not just the best iPhone ever, but also the one with the 'biggest camera update ever' - that would be this year's iPhone 13 Pro, which we have here in Max size. Joining those larger and better cameras, we have a high refresh rate display, more battery, the mandatory chipset upgrade - the 13 Pro Max ticks all the boxes for improving everything that's important. We're here to see by just how much.","The advancements in the camera system start with a new primary unit with a bigger sensor and a brighter lens. The ultrawide module also sports a brighter lens, but one that features autofocus - a first for an iPhone ultrawide. Then there's the telephoto which now offers improved reach up to 3x, albeit with a slightly dimmer lens. On the front, things have remained the same, and no, the 20% reduction in notch size doesn't count.Finally giving in to market trends, Apple's fitted the 13 Pro and Pro Max with 120Hz displays - or, rather, ProMotion. They're the adaptive kind, theoretically capable of variable refresh rates to reach all the way down to 10Hz to preserve battery. That's in addition to an already great screen feature set that includes DolbyVision support, plenty of brightness and excellent color rendition.","2021 iPhones all come with increased battery capacity, and in the 13 Pro Max' case, that's an 18% bump - 2.5 hours more than last year's Pro Max in Apple's metrics, or 'longest battery life ever on an iPhone', and all that.As usual, a new year means an upgraded chipset, and alongside freshly named CPU cores and higher clock rate, the A15 in the 13 Pros also comes with an extra GPU core on top of the non-Pros. Somewhat related, the 13 Pro Max can be specced with up to a full 1TB of storage - that should be useful for iPhone filmmakers if no one else."]
    },{
        "title":"Samsung Galaxy S22 Ultra review",
        "image":"image/blog2.jpg",
        "blog":["The Note that isn't a Note, yet it may very well end up being the last Note - Samsung's Galaxy S22 Ultra has some big shoes to fill. Attempting to appeal to both productivity-focused stylus lovers and photography enthusiasts, the latest Ultra will either be the ultimate phone, period, or fall short for either group in some way. We're here to find out which one is it.","The S Pen fans will have little to complain about on the face of it. The S22 Ultra has the same stylus as the Note20 Ultra and, like a true Note, it has a silo for keeping the thing inside the phone - none of that carry-it-separately-until-you-inevitably-lose-it nonsense with the S21 Ultra. The significant improvements in latency also sound promising, not that the old one was bad.The camera crowd shouldn't be disappointed either. You're getting the same quad setup as the S21 Ultra (in principle, at least) and includes a couple of telephotos reaching all the way to 10x zoom, as well as an autofocusing ultrawide (that Samsung insists on keeping exclusive to the Ultra). That's in addition to the big-sensor nona-binning 108MP main camera, of course.","The lengthy specsheet (summarized below) includes what appears to be the brightest display on a smartphone to date, latest chipsets from Qualcomm or Samsung (depending on locale, as usual), a 1TB storage option (next to a 128GB base tier not befitting the UItra's stature), and a bump in battery capacity and rated charging power (we'll see about that)."]
    },
    {
        "title":"Samsung Galaxy A53 5G review",
        "image":"image/blog1.jpg",
        "blog":["Samsung has been maintaining a particularly strong Galaxy A series of devices for some time now. It has been iterating and improving its value proposition on these phones, and the new 2022 refresh is no different. You can read all about the new Galaxy A73 5G, A53 5G and A33 5G here to see exactly what we mean.","The new Galaxy A53 5G is now here for review. Since the 5X series has arguably been one of the better-geared devices in the series, it is also the toughest one to upgrade. In comparison, this year's Galaxy A33 5G is a much lower hanging fruit seeing how its predecessor came with an LCD.Changes going from the A52s 5G to the A53 5G are a lot more subtle. Simply put, not much has changed, certainly not enough to entice current owners of a recent Galaxy A5X series phone, but there are still some noteworthy changes here and there.","First up - the straight-up positive change - the A53 5G has a larger 5,000mAh battery than its predecessor. There is also a brand new chipset made by Samsung - the Exynos 1280. A modern 5nm part, still not officially present or detailed on Samsung's semiconductor website, but very much already in the wild and looking intriguing with a 2x2.4 GHz Cortex-A78 & 6x2.0 GHz Cortex-A55 CPU configuration, a Mali-G68 GPU and arguably even more versatile 5G setup than the Snapdragon 778G 5G inside the A52s 5G.On the flip side, there are some notable downgrades in the A53 5G as well. For one, it lacks the 3.5mm audio jack of its predecessor. It is also missing Wi-Fi 6 support. Though, it does offer slightly newer Bluetooth 5.1.Other than this, the A53 5G is pretty much identical both in terms of specs and design to its predecessor. Even though, technically, it has shrunk down some in physical size, all the while keeping its display diagonal and weight unchanged. So, you are essentially getting smaller display bezels and a larger battery for \"free\". Not counting the 3.5mm jack, that is.","To sum up, the new Galaxy A53 5G seems to be a slightly \"tweaked\" variant of what Samsung already knows works and sells well. The slightly bigger battery is always nice to see, but what is going to either make or break the A53 5G is definitely the new Exynos 1280 chipset. To be perfectly frank, it just needs to be as good and not even better than the Snapdragon 778G 5G it is replacing. That would mean another wave of happy customers since every other feature of the A53 5G has been carried over from the previous model, and it's still a fantastic package."]
    },
    {
        "title":"Xiaomi 12S Ultra review",
        "image":"image/blog9.jpg",
        "blog": ["A one-inch camera sensor in a phone, and this phone actually uses all of it? The Xiaomi 12S Ultra, the third installment in the company's lineup of ultimate flagships with an extra focus on imaging has just arrived. Unfortunately, just like that pioneering Mi 10 Ultra, this latest one will not be sold outside of China - but we do at least have one for review.","To avoid confusion, let's clear one thing up from the get-go - you probably know that already, but no physical dimension of the 'one-inch' sensor is actually one inch. It's a long-standing oddity in digital camera sensor nomenclature, and we'll talk about it in more detail in the camera section of this review.It's still the largest camera sensor in a smartphone, tied with the Sharp Aquos R6 that practically nobody outside of Japan has seen and the Xperia Pro-I that's gotten more publicity, but has likely sold even fewer units. The China-only Xiaomi means one-inchers will maintain that exclusivity, but it's still closer to a mainstream device than those other two.","Oh, and unlike the Sony that crops from the center of its one-inch sensor, the Xiaomi utilizes all of it. And unlike the Sharp, the latest Ultra has advanced phase detect autofocus. So, tied for size it may be, but it is better - a properly remarkable camera, that much is certain.The rest of the rear setup isn't half bad either - it's just mostly the same as it was on the Mi 11 Ultra. Still great, and in many ways superior to the competition, just not all that new. New is the selfie camera, though, and here it will have to pull its own weight - with the little display on the back now gone, more photo ops will need to be handled by the front camera.","Outside of picturetaking, the 12S Ultra is a true flagship alright. The phone launches in the second half of the year, so time for the plus version of the Snapdragon 8 Gen 1. RAM and storage are ample, the display is cutting-edge, and the little niceties are here - IP68 rating, stereo speakers, infrared port. Battery capacity and charging capability aren't class-leading, but should do just fine. All things considered, that's not a specsheet we can complain about, no."]
    },
    {
        "title":"Huawei nova 9 review",
        "image":"image/blog10.jpg",
        "blog":["The Huawei nova series is intended for the younger generation with flashy looks and relatively low prices. The nova 9 family isn't far from the original formula. We got the vanilla nova 9 for this review, but the Pro model seems to be only slightly different - it has a bigger display, a smaller battery with faster charging and a secondary selfie camera. Sadly, only the standard nova 9 is making its way to the international market leaving the Pro to be a China-exclusive.","However, one would argue that the proper nova 9 might be the more sensible option of the two due to its lower price and relatively the same set of features. In fact, the bigger battery is usually preferred over the faster charging as per our Sunday debate poll from back in the day. Either way, you can use this review as a reference for the Pro model, as most of the hardware is matched.","For €499, the nova 9 offers a flagship-grade 6.57-inch, 120Hz OLED panel and 10-bit color depth, potent Snapdragon 778G and a capable 50MP main camera. The 4,300 mAh battery charges over a speedy 66W brick too. A well-rounded midranger that would surely meet plenty of resistance outside of China.After all, the whole Huawei-US drama isn't over, so Huawei's phones ship without Google Mobile Services, which is less than ideal outside of China. That's a big hurdle to overcome. To be honest, Huawei's HarmonyOS has come a long way with version 2.0. There are plenty of native apps already, and the so-called Petal search provides a fast and easy way to sideload apps through third-party stores.","The nova 9, though, runs on EMUI 12 based on Android 11, which is pretty close to the China-exclusive HarmonyOS. In any case, we will check if the HMS-powered EMUI 12 will make us forget about GMS and see how the device stacks against the competition in terms of raw power, endurance, display quality, etc. You might be in for a surprise."]
    },{
        "title":"iPhone 14 battery life results — here's how long all four models last",
        "image":"image/banner-new.jpg",
        "blog":["You'll definitely want to know your iPhone 14 battery life if you're planning to upgrade to one of Apple's new iPhones, and results vary slightly depending on the model. Of course, there are plenty of ways to measure endurance, but we rate each phone using our own test to see which one is good enough to make a better phone battery list.","Tom's Guide Battery Test involves continuous web browsing over a 5G network with the screen set to 150 nits of screen brightness. We run this test with every phone we review, including the iPhone 14, iPhone 14 Plus, iPhone 14 Pro, and iPhone 14 Pro Max.","Apple doesn't list the battery sizes of its phones, but these are reported based on new phone takedowns and regulation files. So we have included those below with the uptime for each phone. You'll also find battery test results for similar smartphones to put the iPhone 14 battery life results in context."]
    }
]